### Examples

import and setup

In [1]:
import sys
import os

sys.path.append(os.path.abspath(os.path.join(os.getcwd(), '..')))

In [2]:
from edazer import Edazer

load the dataset

In [3]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [5]:
titanic_dz = Edazer(titanic, name="titanic")  #By default, backend = "pandas"

titanic_dz

Analyzer for the DataFrame: titanic

In [6]:
titanic_dz.df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

To summarize datarame

In [7]:
titanic_dz.summarize_df()

DataFrame Info:
-------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB


DataFrame Description:
-------------------------

,count,mean,std,min,25%,50%,75%,99%,max
survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.00000,1.0000
pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.00000,3.0000
age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,65.87000,80.0000
sibsp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,5.00000,8.0000
parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,4.00000,6.0000
fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,249.00622,512.3292

Number of Null Values:
-------------------------

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

Number of Duplicated Rows:
-------------------------

107

Number of Unique Values:
-------------------------

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

DataFrame Shape:
-------------------------
No. of Rows:    891
No. of Columns: 15

To get unique values of columns

In [8]:
titanic_dz.show_unique_values(column_names=titanic.columns)

survived: [np.int64(0), np.int64(1)]
pclass: [np.int64(3), np.int64(1), np.int64(2)]
sex: ['male', 'female']
sibsp: [np.int64(1), np.int64(0), np.int64(3), np.int64(4), np.int64(2), np.int64(5), np.int64(8)]
parch: [np.int64(0), np.int64(1), np.int64(2), np.int64(5), np.int64(3), np.int64(4), np.int64(6)]
embarked: ['S', 'C', 'Q', nan]
class: ['Third', 'First', 'Second']
who: ['man', 'woman', 'child']
adult_male: [np.True_, np.False_]
deck: [nan, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
embark_town: ['Southampton', 'Cherbourg', 'Queenstown', nan]
alive: ['no', 'yes']
alone: [np.False_, np.True_]

Columns with more than 10 unique values: ['age', 'fare']
Consider setting 'max_unique' to a higher value.

To get columns of mentioned dtype

In [ ]:
titanic_dz.cols_with_dtype(dtypes=["int"], return_dtype_map=True)

{'survived': 'int64', 'pclass': 'int64', 'sibsp': 'int64', 'parch': 'int64'}

Combining multiple methods

In [10]:
titanic_dz.show_unique_values(column_names=titanic_dz.cols_with_dtype(dtypes=["object"]))

sex: ['male', 'female']
embarked: ['S', 'C', 'Q', nan]
who: ['man', 'woman', 'child']
embark_town: ['Southampton', 'Cherbourg', 'Queenstown', nan]
alive: ['no', 'yes']

Use all dataframe ops from the df attribute

In [12]:
titanic_dz.df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')